package org.example.simpletest.kotlin.other.hsst

/**
 * DustbinRoomSql
 *
 * @author zhuzhenjie
 * @since 2021/3/31
 */

private val str = """
    310230203217	富民村垃圾箱房	上海市崇明区育富民沙路	…	…	…	121.810831	31.369946
    310230203220	民星村垃圾箱房	上海市崇明区富民支路	…	…	…	121.841012	31.369269
    310230203218	永胜村垃圾箱房	上海市崇明区永胜六路	…	…	…	121.850817	31.363465
    310230203223	民东村垃圾箱房	上海市崇明区东江路	…	…	…	121.868563	31.360119
    310230203214	民建村垃圾箱房	上海市崇明区种子场路	…	…	…	121.87232	31.354605
    310230203222	民永村垃圾箱房	上海市崇明区永江路	…	…	…	121.856943	31.351548
    310230203206	新北村垃圾箱房	上海市崇明区新窑路	…	…	…	121.84515	31.347995
    310230203212	惠丰村垃圾箱房	上海市崇明区横沙2路	…	…	…	121.83038	31.345343
    310230203211	新联村垃圾箱房	上海市崇明区育新练路	…	…	…	121.823331	31.320375
    310230203208	丰乐村垃圾箱房	上海市崇明区西兴路	…	…	…	121.846453	31.330264
    310230203203	公平村垃圾箱房	上海市崇明区公平十四队	…	…	…	121.849161	31.329648
    310230203213	新永村垃圾箱房	上海市崇明区育贤南路	…	…	…	121.857276	31.332355
    310230203210	东兴村垃圾箱房	上海市崇明区鸿斌路	…	…	…	121.872487	31.335499
    310230203201	兴胜村垃圾箱房	上海市崇明区兴胜四路	…	…	…	121.870113	31.318139
    310230203207	兴隆村垃圾箱房	上海市崇明区兴隆支路	…	…	…	121.844576	31.304822
""".trimIndent()

private val images = ""

fun main() {
    val lines = str.split("\n")

    println(lines.size)

    var i = 10000
    lines.forEach { line ->
        i++
        val cols = line.split("\t")
        println(
            """
                insert into dustbin_room 
                (ID,ADDV_CODE,ADDRESS,STATION_NAME,MANAGER_UNIT,CURING_UNIT,LGTD,LTTD,IMAGES)
                values
                ($i,'${cols[0]}','${cols[2]}','${cols[1]}','','',${cols[6]},${cols[7]},'[$images]');
                 """.trimIndent()
        )
    }
}